---
kind: method
id: M:Autodesk.Revit.DB.PanelTypeSet.GetEnumerator
source: html/5629ec19-8dc2-0506-e8ef-c5807e0cf898.htm
---
# Autodesk.Revit.DB.PanelTypeSet.GetEnumerator Method

Retrieve a forward moving iterator to the set.

## Syntax (C#)
```csharp
public virtual IEnumerator GetEnumerator()
```

## Returns
Returns a forward moving iterator to the set.